# The REPL

## What is the REPL?

The REPL (Read-Eval-Print Loop) is an interactive environment for experimenting with Kleis:

```bash
$ cargo run --bin repl
Kleis REPL v0.7
Type 'help' for commands, 'quit' to exit.

kleis>
```

## Basic Usage

Enter expressions to evaluate them:

```
Œª> 2 + 2
2 + 2

Œª> let x = 5 in x * x
times(5, 5)

Œª> sin(œÄ / 2)
sin(divide(œÄ, 2))
```

## Defining Functions

The REPL prompt evaluates **expressions**, not declarations. To define functions, use `:load` with a `.kleis` file:

```
Œª> define square(x) = x * x
‚ùå Parse error: Kleis parse error at position 7: Unexpected character: 's'
```

Instead, create a file `mymath.kleis`:

```kleis
define square(x) = x * x
define compose(f, g, x) = f(g(x))
```

Then load it in the REPL:

```
Œª> :load mymath.kleis
‚úÖ Loaded: 2 functions, 0 structures, 0 data types, 0 type aliases

Œª> square(7)
times(7, 7)

Œª> compose(square, square, 2)
compose(square, square, 2)
```

> **Note:** The REPL performs symbolic evaluation. `square(7)` becomes `times(7, 7)` rather than computing `49`. This is by design - Kleis focuses on symbolic manipulation and verification, not numeric computation.

## Working with Types

Check types and use annotations:

```
Œª> type 42
‚ùå Parse error: Kleis parse error at position 5: Unexpected character: '4'

Œª> :type sin
üìê Type: Œ±0

Œª> let x : ‚Ñù = 3.14 in x * 2
times(3.14, 2)
```

## REPL Commands

| Command | Description |
|---------|-------------|
| `:help` or `?` | Show help |
| `:type <expr>` | Show expression type |
| `:quit` or `q` | Exit REPL |
| `:clear` | Clear definitions |
| `:load <file>` | Load Kleis file |
| `:env` | Show current environment |

## Loading Files

Load Kleis source files:

```
kleis> :load stdlib/prelude.kleis
Loaded: stdlib/prelude.kleis

kleis> :load examples/geometry.kleis
Loaded: examples/geometry.kleis
```

## Verification in REPL

Run verifications interactively:

```
kleis> verify x + y = y + x
‚úì Valid

kleis> verify ‚àÄ n : ‚Ñï . n ‚â• 0
‚úì Valid

kleis> verify x > 0
‚úó Invalid
Counterexample: x = -1
```

## Multi-line Input

For complex expressions, use continuation:

```
kleis> define factorial(n) =
...>     if n = 0 then 1
...>     else n * factorial(n - 1)
Defined: factorial
```

## Lambda Expressions in REPL

Lambda expressions work in the REPL:

```
kleis> Œª x . x * 2
Œª x . x * 2

kleis> (Œª x . x + 1)(5)
6

kleis> define double = Œª x . x * 2
Defined: double

kleis> double(21)
42
```

You can use both the `Œª` symbol and the `lambda` keyword.

## Example Session

```
kleis> // Define a structure
kleis> structure Point { x : ‚Ñù, y : ‚Ñù }

kleis> // Create a point
kleis> let p = Point { x = 3, y = 4 } in
...>     sqrt(p.x^2 + p.y^2)
5.0

kleis> // Verify properties
kleis> verify ‚àÄ a : ‚Ñù . ‚àÄ b : ‚Ñù . (a + b)^2 = a^2 + 2*a*b + b^2
‚úì Valid

kleis> :quit
Goodbye!
```

## Tips and Tricks

1. **Use tab completion** for function names
2. **Arrow keys** navigate history
3. **Ctrl+C** cancels current input
4. **Ctrl+D** exits (like `:quit`)

## What's Next?

See practical applications!

‚Üí [Next: Applications](./13-applications.md)
